import React from "react";
import style from "./AboutUs.module.scss";

const AboutUs = () => {
  return (
    <div className={style.block}>
      <h3>
        Консалтинговая компания{" "}
        <span className={style.logoText}>
          <svg
            width={"48px"}
            height={"38px"}
            className="footer__logo"
            viewBox="0 0 48 38"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M28.7582 0C23.5337 0 18.8082 2.1263 15.3911 5.55096C21.9052 6.4918 26.9226 12.0804 26.9226 18.845C26.9226 25.6097 21.9146 31.2077 15.3911 32.1391C18.8082 35.5638 23.5337 37.6901 28.7582 37.6901C39.1694 37.6901 47.6133 29.2507 47.6133 18.845C47.6133 8.43934 39.1694 0 28.7582 0Z"
              fill="#00DFBD"
            ></path>
            <path
              d="M15.391 5.55141C14.7603 5.45733 14.1202 5.40088 13.4612 5.40088C6.0246 5.40088 0 11.4223 0 18.8549C0 26.2875 6.0246 32.3089 13.4612 32.3089C14.1202 32.3089 14.7603 32.2431 15.391 32.1584C11.9927 28.7526 9.89352 24.0483 9.89352 18.8643C9.89352 13.6803 11.9927 8.97607 15.391 5.57023V5.55141Z"
              fill="#0090FF"
            ></path>
            <path
              d="M26.9132 18.8449C26.9132 12.0708 21.9052 6.48221 15.3817 5.55078C11.9835 8.95663 9.88428 13.6608 9.88428 18.8449C9.88428 24.0289 11.9835 28.7331 15.3817 32.1389C21.8958 31.1981 26.9132 25.6095 26.9132 18.8449Z"
              fill="#0079C5"
            ></path>
          </svg>
          PeoplePay
        </span>{" "}
        оперативно и легально открывает банковские карты со счетами{" "}
        <span>
          в долларах, евро и местной валюте на граждан Российской Федерации
        </span>{" "}
        по нотариально заверенной доверенности <span>в различных</span>
        иностранных банках.
      </h3>

      <p>
        Список банков постоянно пополняется, но{" "}
        <span>
          из-за большого количества обращений, имеются <br />
          ограничения по квотам для граждан Российской Федерации.
        </span>
      </p>
    </div>
  );
};

export default AboutUs;
